; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v13 ?v3)
             (pred_1 ?v4 ?v11)
             (pred_10 ?v13 ?v11)
             (pred_8 ?v7 ?v13 )
	     (pred_9 ?v13)
             (pred_6 ?v9)
             (pred_2 ?v4)
             (pred_7 ?v11)
             (pred_3 ?v13)
             (pred_4 ?v4)
             (pred_12 ?v13)
             (pred_5 ))



(:action op_2
:parameters (?v6 ?v1 ?v5 ?v8)
:precondition (and (pred_6 ?v6) (pred_6 ?v1) (pred_2 ?v5) (pred_7 ?v8)
          (pred_11 ?v6 ?v1) (pred_1 ?v5 ?v8)
                   (pred_10 ?v1 ?v8) (pred_9 ?v6) 
                   (pred_3 ?v1) (pred_4 ?v5))
:effect (and  (pred_12 ?v1) (not (pred_3 ?v1))))


(:action op_4
:parameters (?v6 ?v12)
:precondition (and (pred_6 ?v6) (pred_6 ?v12)
               (pred_9 ?v6) (pred_11 ?v6 ?v12) (pred_12 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v6))))

(:action op_5
:parameters (?v6 ?v5)
:precondition (and (pred_6 ?v6) (pred_2 ?v5) 
                  (pred_9 ?v6) (pred_8 ?v5 ?v6) (pred_5 ))
:effect (and (pred_4 ?v5)
   (not (pred_8 ?v5 ?v6)) (not (pred_5 ))))


(:action op_3
:parameters (?v6 ?v10 ?v2)
:precondition (and (pred_6 ?v6) (pred_2 ?v10) (pred_2 ?v2)
                  (pred_9 ?v6) (pred_4 ?v2) (pred_8 ?v10 ?v6))
:effect (and (pred_4 ?v10) (pred_8 ?v2 ?v6)
        (not (pred_4 ?v2)) (not (pred_8 ?v10 ?v6))))

(:action op_1
:parameters (?v6 ?v5)
:precondition (and (pred_6 ?v6) (pred_2 ?v5) 
                  (pred_9 ?v6) (pred_4 ?v5))
:effect (and (pred_5 ) (pred_8 ?v5 ?v6) (not (pred_4 ?v5)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_02 obj_29 obj_13 obj_03 obj_23 obj_25 obj_26 obj_20 obj_07 obj_30 obj_16 obj_18 obj_22 obj_01 obj_17 obj_24 obj_21 obj_05 obj_14 obj_15 obj_11 obj_27 obj_12 obj_19
    obj_09 obj_08
    obj_04 obj_28 obj_06
    )

    (:init
       (pred_5)

       (pred_6 obj_10)
       (pred_6 obj_02)
       (pred_6 obj_29)
       (pred_6 obj_13)
       (pred_6 obj_03)
       (pred_6 obj_23)
       (pred_6 obj_25)
       (pred_6 obj_26)
       (pred_6 obj_20)
       (pred_6 obj_07)
       (pred_6 obj_30)
       (pred_6 obj_16)
       (pred_6 obj_18)
       (pred_6 obj_22)
       (pred_6 obj_01)
       (pred_6 obj_17)
       (pred_6 obj_24)
       (pred_6 obj_21)
       (pred_6 obj_05)
       (pred_6 obj_14)
       (pred_6 obj_15)
       (pred_6 obj_11)
       (pred_6 obj_27)
       (pred_6 obj_12)
       (pred_6 obj_19)
       (pred_7 obj_09)
       (pred_7 obj_08)
       (pred_2 obj_04)
       (pred_2 obj_28)
       (pred_2 obj_06)

       (pred_11 obj_10 obj_23)
       (pred_11 obj_10 obj_02)
       (pred_11 obj_02 obj_25)
       (pred_11 obj_02 obj_29)
       (pred_11 obj_02 obj_10)
       (pred_11 obj_29 obj_26)
       (pred_11 obj_29 obj_13)
       (pred_11 obj_29 obj_02)
       (pred_11 obj_13 obj_20)
       (pred_11 obj_13 obj_03)
       (pred_11 obj_13 obj_29)
       (pred_11 obj_03 obj_07)
       (pred_11 obj_03 obj_13)
       (pred_11 obj_23 obj_30)
       (pred_11 obj_23 obj_25)
       (pred_11 obj_23 obj_10)
       (pred_11 obj_25 obj_16)
       (pred_11 obj_25 obj_26)
       (pred_11 obj_25 obj_02)
       (pred_11 obj_25 obj_23)
       (pred_11 obj_26 obj_18)
       (pred_11 obj_26 obj_20)
       (pred_11 obj_26 obj_29)
       (pred_11 obj_26 obj_25)
       (pred_11 obj_20 obj_22)
       (pred_11 obj_20 obj_07)
       (pred_11 obj_20 obj_13)
       (pred_11 obj_20 obj_26)
       (pred_11 obj_07 obj_01)
       (pred_11 obj_07 obj_03)
       (pred_11 obj_07 obj_20)
       (pred_11 obj_30 obj_17)
       (pred_11 obj_30 obj_16)
       (pred_11 obj_30 obj_23)
       (pred_11 obj_16 obj_24)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_25)
       (pred_11 obj_16 obj_30)
       (pred_11 obj_18 obj_21)
       (pred_11 obj_18 obj_22)
       (pred_11 obj_18 obj_26)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_22 obj_05)
       (pred_11 obj_22 obj_01)
       (pred_11 obj_22 obj_20)
       (pred_11 obj_22 obj_18)
       (pred_11 obj_01 obj_14)
       (pred_11 obj_01 obj_07)
       (pred_11 obj_01 obj_22)
       (pred_11 obj_17 obj_15)
       (pred_11 obj_17 obj_24)
       (pred_11 obj_17 obj_30)
       (pred_11 obj_24 obj_11)
       (pred_11 obj_24 obj_21)
       (pred_11 obj_24 obj_16)
       (pred_11 obj_24 obj_17)
       (pred_11 obj_21 obj_27)
       (pred_11 obj_21 obj_05)
       (pred_11 obj_21 obj_18)
       (pred_11 obj_21 obj_24)
       (pred_11 obj_05 obj_12)
       (pred_11 obj_05 obj_14)
       (pred_11 obj_05 obj_22)
       (pred_11 obj_05 obj_21)
       (pred_11 obj_14 obj_19)
       (pred_11 obj_14 obj_01)
       (pred_11 obj_14 obj_05)
       (pred_11 obj_15 obj_11)
       (pred_11 obj_15 obj_17)
       (pred_11 obj_11 obj_27)
       (pred_11 obj_11 obj_24)
       (pred_11 obj_11 obj_15)
       (pred_11 obj_27 obj_12)
       (pred_11 obj_27 obj_21)
       (pred_11 obj_27 obj_11)
       (pred_11 obj_12 obj_19)
       (pred_11 obj_12 obj_05)
       (pred_11 obj_12 obj_27)
       (pred_11 obj_19 obj_14)
       (pred_11 obj_19 obj_12)
       (pred_3 obj_20)
       (pred_3 obj_18)
       (pred_3 obj_01)
       (pred_10  obj_20 obj_09)
       (pred_10  obj_18 obj_08)
       (pred_10  obj_01 obj_09)
       (pred_12 obj_10)
       (pred_12 obj_02)
       (pred_12 obj_29)
       (pred_12 obj_13)
       (pred_12 obj_03)
       (pred_12 obj_23)
       (pred_12 obj_25)
       (pred_12 obj_26)
       (pred_12 obj_07)
       (pred_12 obj_30)
       (pred_12 obj_16)
       (pred_12 obj_22)
       (pred_12 obj_17)
       (pred_12 obj_24)
       (pred_12 obj_21)
       (pred_12 obj_05)
       (pred_12 obj_14)
       (pred_12 obj_15)
       (pred_12 obj_11)
       (pred_12 obj_27)
       (pred_12 obj_12)
       (pred_12 obj_19)

       (pred_1  obj_04 obj_09)
       (pred_1  obj_28 obj_08)
       (pred_1  obj_06 obj_08)
       (pred_8 obj_04 obj_26)
       (pred_8 obj_28 obj_30)
       (pred_8 obj_06 obj_17)
       (pred_9 obj_24)
    )

    (:goal (and
       (pred_8 obj_04 obj_03)
       (pred_8 obj_28 obj_05)
    ))
(:constraints
  (always (not (pred_9 obj_18)))
)
)

; plan
1. (op_4 obj_24 obj_16)
   deleted: (pred_9 obj_24)
   added: (pred_9 obj_16)
   goals met: 0 of 2
2. (op_4 obj_16 obj_30)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_30)
   goals met: 0 of 2
3. (op_5 obj_30 obj_28)
   deleted: (pred_8 obj_28 obj_30) (pred_5)
   added: (pred_4 obj_28)
   goals met: 0 of 2
4. (op_4 obj_30 obj_16)
   deleted: (pred_9 obj_30)
   added: (pred_9 obj_16)
   goals met: 0 of 2
5. (op_4 obj_16 obj_25)
   deleted: (pred_9 obj_16)
   added: (pred_9 obj_25)
   goals met: 0 of 2
6. (op_4 obj_25 obj_26)
   deleted: (pred_9 obj_25)
   added: (pred_9 obj_26)
   goals met: 0 of 2
7. (op_2 obj_26 obj_18 obj_28 obj_08)
   deleted: (pred_3 obj_18)
   added: (pred_12 obj_18)
   goals met: 0 of 2
8. (op_3 obj_26 obj_04 obj_28)
   deleted: (pred_4 obj_28) (pred_8 obj_04 obj_26)
   added: (pred_4 obj_04) (pred_8 obj_28 obj_26)
   goals met: 0 of 2
9. (op_4 obj_26 obj_29)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_29)
   goals met: 0 of 2
10. (op_4 obj_29 obj_13)
   deleted: (pred_9 obj_29)
   added: (pred_9 obj_13)
   goals met: 0 of 2
11. (op_2 obj_13 obj_20 obj_04 obj_09)
   deleted: (pred_3 obj_20)
   added: (pred_12 obj_20)
   goals met: 0 of 2
12. (op_4 obj_13 obj_20)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_20)
   goals met: 0 of 2
13. (op_4 obj_20 obj_22)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_22)
   goals met: 0 of 2
14. (op_1 obj_22 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_5) (pred_8 obj_04 obj_22)
   goals met: 0 of 2
15. (op_4 obj_22 obj_20)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_20)
   goals met: 0 of 2
16. (op_4 obj_20 obj_26)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_26)
   goals met: 0 of 2
17. (op_5 obj_26 obj_28)
   deleted: (pred_8 obj_28 obj_26) (pred_5)
   added: (pred_4 obj_28)
   goals met: 0 of 2
18. (op_4 obj_26 obj_20)
   deleted: (pred_9 obj_26)
   added: (pred_9 obj_20)
   goals met: 0 of 2
19. (op_4 obj_20 obj_22)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_22)
   goals met: 0 of 2
20. (op_4 obj_22 obj_05)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_05)
   goals met: 0 of 2
21. (op_1 obj_05 obj_28)
   deleted: (pred_4 obj_28)
   added: (pred_5) (pred_8 obj_28 obj_05)
   goals met: 1 of 2
22. (op_4 obj_05 obj_22)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_22)
   goals met: 1 of 2
23. (op_5 obj_22 obj_04)
   deleted: (pred_8 obj_04 obj_22) (pred_5)
   added: (pred_4 obj_04)
   goals met: 1 of 2
24. (op_4 obj_22 obj_20)
   deleted: (pred_9 obj_22)
   added: (pred_9 obj_20)
   goals met: 1 of 2
25. (op_4 obj_20 obj_13)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_13)
   goals met: 1 of 2
26. (op_4 obj_13 obj_03)
   deleted: (pred_9 obj_13)
   added: (pred_9 obj_03)
   goals met: 1 of 2
27. (op_1 obj_03 obj_04)
   deleted: (pred_4 obj_04)
   added: (pred_5) (pred_8 obj_04 obj_03)
   goals met: 2 of 2
